{
  "symptom_title": "Fridge and Freezer are too warm",
  "url": "https://www.partselect.com/Repair/Refrigerator/Refrigerator-Freezer-Too-Warm/",
  "repair_sections": [
    {
      "id": "ColdControlOr",
      "title": "Cold Control Or Temperature Control",
      "description": "The cold control is a temperature-controlled switch that supplies power to the compressor and fan circuits in the refrigerator. If the compressor and fans are operating normally but not running often enough or long enough to maintain the correct temperatures in the fresh food and freezer sections, then the cold control may be defective or out of calibration. Normal fresh food temperatures are in the 38° Fahrenheit range with the control set to mid-point. Verify that the capillary tube or sensing bulb is not damaged or out of position and that the wire terminals are not loose or corroded.",
      "instructions": [
        "Unplug your refrigerator before beginning, then open your refrigerator door and locate the control. It will be located behind the temperature adjustment knob and is usually found in the fresh food section control panel.",
        "After removing the control from the appliance, turn the control to the warmest setting, set your multi-meter to the Rx1 setting and touch the probes to the terminals",
        "You are testing for continuity and you should receive a reading of infinity. With the probes still touching the terminals, adjust the control to higher (colder) and higher settings. Your reading should change to zero, indicating that you have continuity.",
        "If your control fails either of the tests above, you will need a replacement cold control & temperature control."
      ],
      "related_parts": []
    },
    {
      "id": "EvaporatorFan",
      "title": "Evaporator Fan Motor",
      "description": "The evaporator fan motor is used to circulate the cold air throughout the refrigerator when the compressor is running. If the fan is defective, then temperatures in the freezer section will rise slowly and temperatures in the fresh food section will rise more rapidly and the compressor will run longer and more frequently than normal. With the compressor running you should also hear the evaporator fan running at the same time, as well as the condenser fan which is located next to the compressor.",
      "instructions": [
        "Disconnect your refrigerator from the power source and remove the evaporator fan cover, which will be found in the freezer compartment.",
        "The motor shaft should turn freely with minimal resistance, attempt to turn the shaft manually to check for any resistance.",
        "If there is a significant amount of ice on the motor, defrost your freezer and see if that resolves the issue. You should also inspect the motor for any signs of wear or damage.",
        "If you cannot turn it easily, or if it is noticeably worn, you need a replacement evaporator fan motor."
      ],
      "related_parts": []
    },
    {
      "id": "ElectronicControl",
      "title": "Electronic Control Board",
      "description": "Some newer models of refrigerators may use an electronic control board. Thermistors or temperature sensors are connected to the control board and are used to monitor temperatures in the fresh food and freezer compartments. The control board uses this information to control the operation of the compressor, fan motors and defrost system. If the temperatures are too warm, then the electronic control could be at fault. Electronic controls are complex and expensive and usually reliable, so you should first verify that all of the other components such as the compressor, fans and sensors are operating properly before condemning the control. Some manufacturers may provide specific information that will help in diagnosing a defective control.",
      "instructions": [
        "Unplug your fridge before beginning as you will be handling electrical components.",
        "Locate and remove the electronic control board from your appliance. It is inside of the refrigerator, inside of the control box, which is usually found attached to the top or side of the fridge.",
        "Inspect your control board for any signs of damaged foil, wear, burnt connections, arcing, or any other damage.",
        "If you find any of the above, you need a replacement electronic control board."
      ],
      "related_parts": []
    },
    {
      "id": "TemperatureSensorOr",
      "title": "Temperature Sensor Or Thermistor",
      "description": "In models that use an Electronic Control, a thermistor or temperature sensor may be used to monitor fresh food and freezer temperatures. The sensor is a small capsule like device that is protected by a plastic shield and will vary in resistance depending on the temperature. The control board uses this information to turn on the compressor and fan circuits as well as to operate the damper control on some models. If a sensor becomes damaged or defective it may incorrectly signal the control board to turn off the compressor and fans and result in warmer than normal fresh food and freezer temperatures. Individual manufacturers may have specific information available to test these sensors, depending on the model involved, and may also provide a fault code on the electronic control board on some models.",
      "instructions": [
        "Begin by unplugging your refrigerator, then remove the back panel of your refrigerator to locate the main control board.",
        "The thermistor(s) will be connected to the main control board. Remove the thermistor(s) from the appliance in order to test them.",
        "Before testing them, you will need to place the thermistor(s) in ice water for 5 minutes in order to bring the temperature to 32 degrees F. The thermistor(s) will produce different readings at different temperatures, and the suggested ranges below only apply to thermistors at a temperature of 32 degrees F.",
        "With the probes on the terminals and your multi-meter set to Rx1, you should receive a reading of 16,600 ohms (+/- 5 percent).",
        "If you receive a reading outside this range, you will need a replacement temperature sensor or thermistor."
      ],
      "related_parts": []
    },
    {
      "id": "DefrostTimer",
      "title": "Defrost Timer",
      "description": "The defrost timer is an electro-mechanical timer that operates a set of contacts that control both the compressor circuit as well as the defrost heater circuit. Most timers will activate a defrost cycle every 8-10 hours of compressor run time. This normally occurs about once every day or two. The defrost timer will normally terminate the defrost cycle after 20 to 30 minutes and the compressor and fans will start again.",
      "instructions": [
        "Disconnect your appliance from the power source and locate your defrost timer. It can be located behind the refrigerator's lower kickplate, in the refrigerator's control panel, or even behind the refrigerator on its back wall.",
        "After locating it, remove the defrost timer from the appliance in order to test it",
        "Using a multi-meter on the Rx1 setting, with one probe touching the common terminal (it should be labeled \"3\" or \"C\"), touch the other lead to the other three remaining terminals, one at a time. Testing the first pair should produce a reading of zero, or near zero, denoting continuity. The second pair may also result in a reading of zero or near zero. Testing the third pair of terminals should produce a reading of infinity.",
        "If you do not receive these readings, you will need a replacement defrost timer."
      ],
      "related_parts": []
    },
    {
      "id": "DefrostThermostat",
      "title": "Defrost Thermostat",
      "description": "The defrost thermostat is a safety thermostat in series with the defrost heater and is used to terminate the defrost cycle when the evaporator reaches a specific temperature, usually rated at 38° to 47° Fahrenheit. If the thermostat is defective and remains open circuit, then the defrost heater will not be energized and no defrosting will take place.",
      "instructions": [
        "Unplug your refrigerator and locate your refrigerator's defrost thermostat. In freezer-on-top models, it may be located under the floor of the unit, or it could be found at the back of the freezer. If you have a side-by-side refrigerator, the defrost thermostat is found at the back of the freezer side.",
        "Once you have located it, remove the defrost thermostat in order to test it. You will have to remove any objects that are in your way such as the contents of the freezer, freezer shelves, icemaker parts, and the inside rear, back, or bottom panel.",
        "Set your multi-meter to the Rx1 setting. Place each of the probes on a thermostat wire. When your thermostat is cold, it should produce a reading of zero on your multi-meter. If it is warm (anywhere from forty to ninety degrees Fahrenheit), then this test should produce a reading of infinity.",
        "If the results you receive from your test differ from the ones presented here, then you will need a replacement defrost thermostat."
      ],
      "related_parts": []
    },
    {
      "id": "DefrostHeater",
      "title": "Defrost Heater",
      "description": "The defrost heater is the device that melts the ice and frost from the evaporator coils. It is typically a wire filament contained in a glass or aluminum tube. There may be more than one heater depending on the shape of the evaporator.",
      "instructions": [
        "Ensure that you have disconnected your appliance from the power source before beginning.",
        "Locate your defrost heater. It can be located behind the back panel of the freezer section of your refrigerator, or under the floor of your refrigerator's freezer section. Defrost heaters are commonly located beneath a refrigerator's evaporator coils. You will have to remove any objects that are in your way such as the contents of the freezer, freezer shelves, icemaker parts, and the inside rear, back, or bottom panel.",
        "Before you can test your defrost heater, you must remove it from your refrigerator. A defrost heater is connected by two wires, and the wires are connected with slip-on connectors. Firmly grasp these connectors and pull them off the terminals. You may need a pair of needle-nosed pliers to help you. Do not pull on the wires themselves.",
        "Use your multi-meter to test the heater for continuity. Set your multi-meter to the Rx1 scale and place the tester's leads on one terminal each. This should produce a reading anywhere in between zero and infinity.",
        "If you receive a reading of zero or infinity, you will need a replacement defrost heater."
      ],
      "related_parts": []
    },
    {
      "id": "CondenserFan",
      "title": "Condenser Fan Motor",
      "description": "Most modern frost-free refrigerators will have a fan cooled condenser coil. This normally located near the compressor at the bottom rear of the refrigerator. The condenser fan circulates air through the condenser coil to remove heat. If the refrigerator is warmer than normal and the compressor is running almost continuously, then you may have a problem with the condenser fan motor. The condenser fan motor runs at the same time as the evaporator motor and the compressor. If the fan motor is not turning at all the condenser will not be able to expel the excess heat and the compressor will run almost continuously",
      "instructions": [
        "Begin by unplugging your refrigerator from the power source and then remove the rear access panel to locate the condenser fan motor, it is usually found at the bottom rear of the appliance.",
        "Once you have located it, Look for any debris or obstructions that could be preventing the fan from moving freely. You should also inspect the condenser fan motor for any signs of wear or damage..",
        "If the fan motor is seized or worn, you will need a replacement condenser fan motor."
      ],
      "related_parts": []
    }
  ],
  "repair_stats": {
    "difficulty": "EASY",
    "repair_stories_count": 785,
    "step_by_step_videos_count": 15
  }
}