{
  "symptom_title": "Noisy",
  "url": "https://www.partselect.com/Repair/Refrigerator/Noisy/",
  "repair_sections": [
    {
      "id": "CondenserFan",
      "title": "Condenser Fan Motor",
      "description": "Most modern frost-free refrigerators will have a fan cooled condenser coil. The condenser fan circulates air through the condenser coil to remove heat as well as circulating air over the drain pan to evaporate the defrost water. If your fridge is making a loud noise, the condenser fan motor could be to blame. The condenser fan motor runs at the same time as the evaporator motor and the compressor. In addition to noise, your fridge might not be staying as cool as normal and/or may be turning on and off regularly.",
      "instructions": [
        "Disconnect your refrigerator from the power source and then remove the rear access panel.",
        "Locate the condenser fan motor, it is usually found near the compressor at the bottom rear of the refrigerator.",
        "Visually inspect the condenser fan motor for any signs of wear or damage. Look for any debris or obstructions that could be preventing the fan from moving freely.",
        "If the fan motor is seized or worn, you will need a replacement condenser fan motor."
      ],
      "related_parts": []
    },
    {
      "id": "EvaporatorFan",
      "title": "Evaporator Fan Motor",
      "description": "The evaporator fan motor is responsible for pulling air over the evaporator coils when the compressor is running. If your refrigerator is making a loud noise that appears to be coming from the freezer area, a faulty evaporator fan motor could be to blame. You may also notice that your refrigerator is not staying as cold as normal, or your ice is taking longer to freeze.",
      "instructions": [
        "After unplugging your refrigerator, remove the evaporator fan cover. The evaporator fan cover is located inside the unit in the freezer compartment.",
        "Inspect the evaporator motor for any signs of wear or damage. If there is a significant amount of ice on the motor, defrost your freezer and see if that resolves the issue.",
        "Attempt to manually turn the motor shaft, it should turn freely with minimal resistance.",
        "If you cannot turn it easily, or if it is noticeably worn, you need a replacement evaporator fan motor."
      ],
      "related_parts": []
    },
    {
      "id": "EvaporatorFanMotor",
      "title": "Evaporator Fan Motor Grommet",
      "description": "The evaporator fan motor grommet is used to isolate the motor from the mounting bracket and reduce vibration noise. Regular wear and tear can cause the grommets to wear or become detached, which can increase vibration and cause excess noise.",
      "instructions": [
        "Unplug your refrigerator.",
        "Remove the evaporator fan cover, which will be found inside the freezer compartment.",
        "Inspect the grommet to see if it has fallen off, or it if is showing signs of wear or damage..",
        "If any of the above are true, you will need a replacement evaporator fan motor grommet."
      ],
      "related_parts": []
    }
  ],
  "repair_stats": {
    "difficulty": "EASY",
    "repair_stories_count": 1875,
    "step_by_step_videos_count": 33
  }
}