{
  "symptom_title": "Door Sweating",
  "url": "https://www.partselect.com/Repair/Refrigerator/Door-Sweating/",
  "repair_sections": [
    {
      "id": "FreshFoodAnd",
      "title": "Fresh Food & Freezer Door Gasket",
      "description": "Leaky or damaged door seals can create excess moisture that is visible near the air outlet ducts or on shelves in the freezer. Damaged gaskets can also prevent doors from closing properly and may introduce enough moisture into the refrigerator that defrost issues may occur. Moisture along the edge of the door is a good indication that the gaskets are not sealing properly and should be replaced.",
      "instructions": [
        "Take a piece of paper, and place it at various points along the door.",
        "Close the door normally and slide the paper out.",
        "If the paper slides out without any resistance, then you will need replacement fresh food & freezer door gasket(s)."
      ],
      "related_parts": []
    },
    {
      "id": "DispenserDoorAssembly",
      "title": "Dispenser Door Assembly or Flapper & Ice Door Kit",
      "description": "When activated, the ice dispenser door opens so that ice can be dispensed from the icemaker. The door or flapper is normally spring loaded and will have a vinyl or foam rubber seal attached to prevent room air from entering the refrigerator. If there is moisture around the front of the dispenser or if there is signs of moisture in the ice bin area, then this would indicate that the door is not closing completely. The flapper door is hinged and is normally operated by a solenoid with a return spring and often with a damper to slow the closing action to prevent the door from closing on an ice cube.",
      "instructions": [
        "Remove the dispenser cover in order to inspect its components.",
        "You should inspect the following parts for damage or wear.",
        "Door hinges.",
        "Door seal.",
        "Door pivot mechanism.",
        "Return spring.",
        "Solenoid plunger and linkage.",
        "Damper.",
        "If you find any issues while checking the above parts, you may need a replacement dispenser door assembly or flapper & ice door kit."
      ],
      "related_parts": []
    },
    {
      "id": "DoorClosureCam",
      "title": "Door Closure Cam Kit",
      "description": "In some models of side-by-side refrigerators, closer cams on the lower door hinges are used to assist in closing the doors. The cams are made of hard plastic or nylon and have sloped shoulders on them that mate together. One cam is mounted to the bottom of the door and the other is mounted to the top of the hinge. When the door is opened, the door cam rotates up out of the hinge cam, lifting the door up and a detent allows it to stay in an open position. When closing the door, the weight of the door forces the door to pivot closed as the cams mate together. If either of these cams is broken, then the door may not close tightly. This would allow warm outside air to enter the refrigerator and cause condensation to form.",
      "instructions": [
        "Open your refrigerator door and locate the closer cams.",
        "Visually inspect the closer cams to verify that they are not cracked, worn, or otherwise damaged.",
        "If they are damaged, you will need a replacement closure cam kit."
      ],
      "related_parts": []
    },
    {
      "id": "DoorHingeAnd",
      "title": "Door Hinge & Bearing",
      "description": "Fresh food and freezer doors rotate on hinges. The hinges act as bearings and the doors should pivot easily on them. If the hinges become worn or dry of lubricant, they may prevent the doors from closing completely. This could allow room air into the refrigerator and cause moisture problems. A common symptom of a faulty hinge bearing is when opening or closing the door a thumping and/or scraping noise can be heard.",
      "instructions": [
        "Open and remove your refrigerator door in order to locate the hinge & bearing.",
        "Inspect the hinges for any signs of cracking or damage. If they are not damaged, lubricate the hinges with a food safe grease to see if that resolves the issue.",
        "If they are damaged or greasing the hinges does not solve the issue, you need replacement door hinges & bearings."
      ],
      "related_parts": []
    }
  ],
  "repair_stats": {
    "difficulty": "EASY",
    "repair_stories_count": 769,
    "step_by_step_videos_count": 11
  }
}