{
  "symptom_title": "Will not start",
  "url": "https://www.partselect.com/Repair/Refrigerator/Will-Not-Start/",
  "repair_sections": [
    {
      "id": "OverloadOrRelay-Start",
      "title": "Overload Or Relay-Start Capacitor",
      "description": "The overload relay is a protection device used in the compressor circuit on your refrigerator. Power is applied to the compressor motor windings through the overload device, and the relay is used to add the start winding in the circuit until the compressor is at running speed. If the fans are running and your compressor won’t start or if you hear a clicking sound from the unit, check the overload relay for signs of overheating or arcing.",
      "instructions": [
        "Begin by ensuring you have unplugged your refrigerator, and then remove the rear panel.",
        "Locate and remove your overload or relay-start capacitor. On modern refrigerators the overload relay is usually a combined part and plugs directly onto the side of the compressor. There may also be a start capacitor attached to the relay overload assembly, which provides increased starting voltage to the compressor windings.",
        "To test, begin by discharging the capacitor, then set your multi-meter to the Rx1 setting and place the probes onto the terminals of the overload capacitor and/or the relay-start capacitor. The reading you should receive will vary from model to model, and may be indicated on the outside of the capacitor, or in your owner’s manual.",
        "If your test does not produce the reading the manufacturer recommends, you need a replacement overload or relay-start capacitor. If your tests do produce the recommended readings you may have a defective compressor, which will need to be tested by a qualified professional as it is a live circuit test."
      ],
      "related_parts": []
    },
    {
      "id": "ColdControlAnd",
      "title": "Cold Control & Temperature Control",
      "description": "The cold control is a temperature-controlled switch that supplies power to the compressor and fan circuits in the refrigerator. If your refrigerator won’t start and no fans are running, then you may have a defective control.",
      "instructions": [
        "After disconnecting your appliance from the power source, open your refrigerator door and locate the control. It will be located behind the temperature adjustment knob and is usually found in the fresh food section control panel.",
        "Remove the control from the fridge in order to test it.",
        "Using a multi-meter on the Rx1 setting, set your control to the lowest (warmest) setting, and place the probes on the terminals. You are testing for continuity and you should receive a reading of infinity.",
        "With the probes still on the terminals, adjust the control to higher (colder) and higher settings, your reading should then change to zero, indicating that you have continuity.",
        "If your control fails either of the tests above, you will need a replacement cold control & temperature control."
      ],
      "related_parts": []
    },
    {
      "id": "ElectronicControl",
      "title": "Electronic Control Board",
      "description": "Some newer refrigerators are controlled by an Electronic Control Board that monitors temperatures and controls the compressor, fans and defrost system. If your refrigerator will not start, the control board could be at fault. Electronic controls are complex and expensive. You should first verify that there is no power being supplied to the compressor, that you have incoming power to the control board and that the external controls are functioning properly before condemning the electronic control.",
      "instructions": [
        "Ensure that you have disconnected your appliance from the power before beginning as you will be handling electrical components.",
        "Open your refrigerator door to locate and remove the electronic control board from your appliance. It will be located inside the control box, which is usually found attached to the top or side of the fridge.",
        "Look on the control board for signs of arcing, burnt connections, damaged foil, wear, or any other damage.",
        "If you find any of the above, you need a replacement electronic control board."
      ],
      "related_parts": []
    }
  ],
  "repair_stats": {
    "difficulty": "EASY",
    "repair_stories_count": 365,
    "step_by_step_videos_count": 8
  }
}