{
  "symptom_title": "Not draining",
  "url": "https://www.partselect.com/Repair/Dishwasher/Not-Draining/",
  "repair_sections": [
    {
      "id": "PistonAndNut",
      "title": "Piston & Nut Assembly",
      "description": "Some models of dishwashers utilize a check valve as part of the drain pump. Within the check valve, there is the piston and nut assembly. If your dishwasher is not draining water properly, the piston and nut assembly could be the source of the problem.",
      "instructions": [
        "Disconnect your appliance from the power source.",
        "Locate your piston & nut assembly. It likely will be found on the bottom of the tub, beneath the sump cover.",
        "Inspect your piston & nut assembly to determine if it is functioning properly. The assembly should move up and down freely. When the piston is in the down position, it should form a tight seal. If it is not forming a complete seal, the dishwasher will not completely pump out the water.",
        "If you find any issues while performing the inspection, you will need a replacement piston & nut assembly."
      ],
      "related_parts": [
        {
          "name": "OEM Replacement Dishwasher Parts",
          "url": "https://www.partselect.com/Dishwasher-Parts.htm",
          "text": "replacement piston &amp; nut assembly"
        }
      ]
    },
    {
      "id": "DrainPumpAnd",
      "title": "Drain Pump & Motor",
      "description": "All dishwashers will have a method to drain the water. Most models will have a single motor driven pump with two separate compartments, one for circulation and one for drain, each with its own impeller. Other types will have a separate drain pump, and some will utilize the main circulating pump in conjunction with a drain solenoid and diverter valve or flapper. On models that use a separate drain pump, you should check to see if there is any obstruction to the input and output of the pump and also verify that there is power getting to the pump motor during the drain portion of the cycle.",
      "instructions": [
        "Before beginning, ensure that you have disconnected your appliance from the power source.",
        "Locate and remove your dishwasher pump. It likely will be found behind the lower access panel.",
        "Once you have removed it, using a multimeter on Rx1 mode, touch the pump’s terminals with the probes. You are testing for continuity and should receive a reading of zero or nearly zero. Next, you should test the ground connection by touching one of the probes to the bare metal housing while leaving one on a terminal. This test should not produce any reading.",
        "If the results of your tests are different from the above, you will need a replacement pump."
      ],
      "related_parts": [
        {
          "name": "OEM Replacement Dishwasher Pumps",
          "url": "https://www.partselect.com/Dishwasher-Pumps.htm",
          "text": "replacement pump"
        }
      ]
    },
    {
      "id": "CheckValve",
      "title": "Check Valve Flapper",
      "description": "Some dishwasher models will use a check valve in the drain outlet. The check valve is used to allow water to flow in one direction but will prevent the dirty water from re-entering the dishwasher. If you suspect that the drain hose has a restriction or if you find that wastewater is getting back into the dishwasher tub, then the check valve is most likely the problem.",
      "instructions": [
        "To ensure your safety, unplug your dishwasher before beginning this inspection.",
        "Locate your check valve flapper in order to inspect it. In most models, it will be found on the outlet port of the drain pump or housing. You will need to remove the lower access panel in order to inspect it.",
        "Visually inspect the flapper for any signs of wear or damage. You should also check to see if there is any dirt or debris preventing the flapper from moving freely, remove anything you may find.",
        "If your valve is damaged, or if you find no objects preventing it from opening properly, you will need a replacement check valve flapper."
      ],
      "related_parts": [
        {
          "name": "OEM Replacement Dishwasher Parts",
          "url": "https://www.partselect.com/Dishwasher-Parts.htm",
          "text": "replacement check valve flapper"
        }
      ]
    },
    {
      "id": "Belt",
      "title": "Belt",
      "description": "Some older dishwashers may use a belt driven pump. If the belt has come off or is slipping, then the pump that drains the dishwasher won’t function properly.",
      "instructions": [
        "Similar to other dishwasher inspections, disconnect your appliance from the power source before beginning.",
        "Your dishwasher belt will be found behind the lower access panel, attached to a pulley on the pump assembly and to another pulley on the motor assembly. Remove the belt in order to closely inspect it.",
        "Looking for any signs of burning, stretching, cracking, damage, or wear, inspect the belt.",
        "If you find any issues while inspecting it, you will need a replacement belt."
      ],
      "related_parts": [
        {
          "name": "OEM Replacement Dishwasher Parts",
          "url": "https://www.partselect.com/Dishwasher-Parts.htm",
          "text": "replacement belt"
        }
      ]
    },
    {
      "id": "Timer",
      "title": "Timer",
      "description": "Some dishwashers will use a mechanical timer to operate the cycles. The timer controls the main pump motor as well as the drain solenoid or separate drain pump motor if your model has that style. The timer is normally located in the control panel at the top of the dishwasher door. You will require a wiring diagram and schematic to identify the correct timer contacts that control the drain cycle. These can then be checked for continuity with a multi-meter and if defective then the timer will need to be replaced.",
      "instructions": [
        "Unplug your dishwasher before beginning this test.",
        "Your timer will likely be found either in the control panel or behind the lower kickplate. Locate and remove your appliance’s timer in order to test it.",
        "If your model has multiple sets of contacts/wires, you will need to refer to your owner’s manual to determine which sets to test.",
        "Remove the timer from your appliance, set your multimeter to Rx1000, and touch the contacts/wires with the probes. In most models, a functional timer will produce a reading of 2000-3500 ohms of resistance, but this varies from model to model. Please refer to your owner's manual to determine what reading you should see.",
        "If the results of your test are different than the manufacturer’s guidelines, you will need a replacement timer."
      ],
      "related_parts": [
        {
          "name": "OEM Replacement Dishwasher Timers",
          "url": "https://www.partselect.com/Dishwasher-Timers.htm",
          "text": "replacement timer"
        }
      ]
    },
    {
      "id": "DrainHose",
      "title": "Drain Hose",
      "description": "A dishwasher will not drain properly if it has a restricted or clogged drain hose. Restrictions typically appear most often at the outlet from the pump or drain housing where a check valve may be located, at the input to the household drain system or anywhere that a kink may have formed in the drain hose. If food debris has caused a restriction, then you should check the condition of the food chopper as a possible source of the problem.",
      "instructions": [
        "Verify that the water and power sources have been disconnected from your dishwasher before beginning this inspection.",
        "Remove the lower access panel of your appliance and locate the drain. It will be connected to a pump below the lower spray arm.",
        "Remove the hose in order to inspect the drain hose closely. You are looking for any visible signs of cracking, damage or wear. You should also attempt to run water through the hose to determine if there is a blockage inside.",
        "If any issues are found while doing the inspections above, you will need a replacement hose."
      ],
      "related_parts": [
        {
          "name": "OEM Replacement Dishwasher Hoses",
          "url": "https://www.partselect.com/Dishwasher-Hoses-and-Tubes.htm",
          "text": "replacement hose"
        }
      ]
    }
  ],
  "repair_stats": {
    "difficulty": "EASY",
    "repair_stories_count": 564,
    "step_by_step_videos_count": 7
  }
}